run/shockTube/water/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
    	type		pressureInletOutletVelocity;
    	phi         phi;
        rho         rho;
        tangentialVelocity  uniform (0 0 0);
        value       uniform (30 0 0);
    }
    
    outlet
    {
        type        pressureInletOutletVelocity;
        phi         phi;
        rho         rho;
        tangentialVelocity uniform (0 0 0);
        value       uniform (30 0 0);
    }
    
    top
    {
    	type		zeroGradient;
    }
    
    bottom
    {
    	type		zeroGradient;
    }

    frontAndBack
    {
    	type		empty;
    }
}


// ************************************************************************* //
