run/shockTube/water/0_orig/alpha.H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
    	type		fixedValue;
    	value		uniform 0;
    }
    
    outlet
    {
    	type		inletOutlet;
        inletValue  uniform 0;
        value       uniform 0;
    }
    
    top
    {
    	type		inletOutlet;
        inletValue  uniform 0;
        value       uniform 0;
    }

    bottom
    {
    	type		inletOutlet;
        inletValue  uniform 0;
        value       uniform 0;
    }
    
    frontAndBack
    {
    	type		empty;
    }
}


// ************************************************************************* //
