run/shockTube/water/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 61582.32;

boundaryField
{
    inlet
    {
    	type		calculated;
    	value		uniform 68947.57;
    }
    
    outlet
    {
        type        zeroGradient;
    }
    
    top
    {
    	type		zeroGradient;
    }
    
    bottom
    {
    	type		zeroGradient;
    }

    frontAndBack
    {
    	type		empty;
    }
}

// ************************************************************************* //
