run/shockTube/water/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMultiDimRefineFvMesh;

enableBalancing false;

adaptCriteria
{
    type        composedAdaptCriteria;
    operation   or;
    criteria
    (
        fluid
        {
            type            fieldBounds;
            fieldName       alpha.H2O;
            lowerBound      1e-8;
            upperBound      0.99999999;
	        nLayer	        5;
        }
    );    
}
// How often to refine
refineInterval  2;

// Have slower than 2:1 refinement
nBufferLayers   4;

// Refine cells only up to maxRefinement levels
maxRefinement   3;

// Stop refinement if maxCells reached
maxCells        10000000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi none)
    (nHatf none)
    (rhoPhi none)
    (alphaPhi none)
    (alphaPhi_ none)
    (alphaPhi0.H2O none)
    (alphaPhiUn none)
    (ghf none)
    (phi0 none)
    (dVf_ none)
);

// Write the refinement level as a volScalarField
dumpLevel       true;





// ************************************************************************* //
