run/shockTube/water/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-3;

xMin -4;
xMax 56;
yMin -16;
yMax 16;
zMin -0.1;
zMax 0.1;

vertices
(
    ($xMin $yMin $zMin)	//0
    ($xMax $yMin $zMin)	//1
    ($xMax $yMax $zMin)	//2
    ($xMin $yMax $zMin)	//3
    ($xMin $yMin $zMax)	//4
    ($xMax $yMin $zMax)	//5
    ($xMax $yMax $zMax)	//6
    ($xMin $yMax $zMax)	//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (960 512 1) simpleGrading (1 1 1)
);

patches
(
    patch inlet
    (
    	(0 4 7 3)
    )
    
    patch outlet
    (
    	(2 6 5 1)
    )
    
    patch top
    (
        (3 7 6 2)
    )

    patch bottom
    (
        (1 5 4 0)
    )

    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
();

// ************************************************************************* //
